In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

df_raw = pd.read_csv('spy.csv')

In [6]:
df_raw.head()

,Date,Open,High,Low,Close,Volume,Day,Weekday,Week,Month,Year
0,1993-01-29,25.236158,25.236158,25.110605,25.218222,1003200,29,4,4,1,1993
1,1993-02-01,25.236146,25.397572,25.236146,25.397572,480500,1,0,5,2,1993
2,1993-02-02,25.379673,25.469354,25.325865,25.451418,201300,2,1,5,2,1993
3,1993-02-03,25.487270,25.738376,25.469334,25.720440,529400,3,2,5,2,1993
4,1993-02-04,25.810132,25.881876,25.523153,25.828068,531500,4,3,5,2,1993

In [7]:
df_raw['avg'] = (df_raw['High'] + df_raw['Low']) / 2 

df_raw.head()

,Date,Open,High,Low,Close,Volume,Day,Weekday,Week,Month,Year,avg
0,1993-01-29,25.236158,25.236158,25.110605,25.218222,1003200,29,4,4,1,1993,25.173381
1,1993-02-01,25.236146,25.397572,25.236146,25.397572,480500,1,0,5,2,1993,25.316859
2,1993-02-02,25.379673,25.469354,25.325865,25.451418,201300,2,1,5,2,1993,25.397609
3,1993-02-03,25.487270,25.738376,25.469334,25.720440,529400,3,2,5,2,1993,25.603855
4,1993-02-04,25.810132,25.881876,25.523153,25.828068,531500,4,3,5,2,1993,25.702515

In [11]:
df_raw['day_change'] = df_raw['avg'].pct_change() * 100
df_raw['5day_change'] = df_raw['avg'].pct_change(periods=5) * 100

df_raw.head(10)

,Date,Open,High,Low,Close,Volume,Day,Weekday,Week,Month,Year,avg,day_change,5day_change
0,1993-01-29,25.236158,25.236158,25.110605,25.218222,1003200,29,4,4,1,1993,25.173381,NaN,NaN
1,1993-02-01,25.236146,25.397572,25.236146,25.397572,480500,1,0,5,2,1993,25.316859,0.569958,NaN
2,1993-02-02,25.379673,25.469354,25.325865,25.451418,201300,2,1,5,2,1993,25.397609,0.318959,NaN
3,1993-02-03,25.487270,25.738376,25.469334,25.720440,529400,3,2,5,2,1993,25.603855,0.812067,NaN
4,1993-02-04,25.810132,25.881876,25.523153,25.828068,531500,4,3,5,2,1993,25.702515,0.385332,NaN
5,1993-02-05,25.810129,25.863938,25.666640,25.810129,492100,5,4,5,2,1993,25.765289,0.244233,2.351323
6,1993-02-08,25.810129,25.899810,25.774257,25.810129,596100,8,0,6,2,1993,25.837033,0.278455,2.054656
7,1993-02-09,25.720445,25.720445,25.576956,25.630764,122100,9,1,6,2,1993,25.648700,-0.728927,0.988639
8,1993-02-10,25.630748,25.684556,25.559003,25.666620,379600,10,2,6,2,1993,25.621780,-0.104958,0.070009
9,1993-02-11,25.702495,25.899792,25.702495,25.792175,19500,11,3,6,2,1993,25.801143,0.700043,0.383732

In [12]:
df_raw['upcoming_change'] = df_raw['day_change'].shift(-1)
df_raw['upcoming_5day_change'] = df_raw['5day_change'].shift(-5)

df_raw.head(10)

,Date,Open,High,Low,Close,Volume,Day,Weekday,Week,Month,Year,avg,day_change,5day_change,upcoming_change,upcoming_5day_change
0,1993-01-29,25.236158,25.236158,25.110605,25.218222,1003200,29,4,4,1,1993,25.173381,NaN,NaN,0.569958,2.351323
1,1993-02-01,25.236146,25.397572,25.236146,25.397572,480500,1,0,5,2,1993,25.316859,0.569958,NaN,0.318959,2.054656
2,1993-02-02,25.379673,25.469354,25.325865,25.451418,201300,2,1,5,2,1993,25.397609,0.318959,NaN,0.812067,0.988639
3,1993-02-03,25.487270,25.738376,25.469334,25.720440,529400,3,2,5,2,1993,25.603855,0.812067,NaN,0.385332,0.070009
4,1993-02-04,25.810132,25.881876,25.523153,25.828068,531500,4,3,5,2,1993,25.702515,0.385332,NaN,0.244233,0.383732
5,1993-02-05,25.810129,25.863938,25.666640,25.810129,492100,5,4,5,2,1993,25.765289,0.244233,2.351323,0.278455,-0.348124
6,1993-02-08,25.810129,25.899810,25.774257,25.810129,596100,8,0,6,2,1993,25.837033,0.278455,2.054656,-0.728927,-2.395053
7,1993-02-09,25.720445,25.720445,25.576956,25.630764,122100,9,1,6,2,1993,25.648700,-0.728927,0.988639,-0.104958,-2.867165
8,1993-02-10,25.630748,25.684556,25.559003,25.666620,379600,10,2,6,2,1993,25.621780,-0.104958,0.070009,0.700043,-2.835085
9,1993-02-11,25.702495,25.899792,25.702495,25.792175,19500,11,3,6,2,1993,25.801143,0.700043,0.383732,-0.486605,-3.336765